;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; Completion.
(package! company-box)

;; C/C++.
(package! cpp-auto-include)
(package! cmake-ide)
(package! flycheck-clang-tidy)
(package! google-c-style)

;; Edit.
(package! move-text)

;; Graphviz.
(package! graphviz-dot-mode)

;; Ini.
(package! ini-mode)

;; Kubernetes.
(package! kubernetes)

;; Markdown.
(package! markdown-preview-mode)
(package! pandoc-mode)

;; Protobuf.
(package! protobuf-mode)

;; Sql.
(package! sql)
;; Systemd.
(package! systemd)

;; UI.
(package! auto-dim-other-buffers)

;; Yang.
(package! yang-mode)
