aaron-bond.better-comments
alygin.vscode-tlaplus
ArashSahebolamri.alloy
arrterian.nix-env-selector
azemoh.one-monokai
baccata.scaladex-search
betterthantomorrow.calva
betterthantomorrow.calva-spritz
castwide.solargraph
connorshea.vscode-ruby-test-adapter
coolbear.systemd-unit-file
cschlosser.doxdocgen
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
DongyuZhao.alloy-vscode
dorzey.vscode-sqlfluff
eamodio.gitlens
elmTooling.elm-ls-vscode
esbenp.prettier-vscode
exiasr.hadolint
formulahendry.code-runner
formulahendry.terminal
foxundermoon.shell-format
fwcd.kotlin
golang.go
hashicorp.terraform
haskell.haskell
hbenl.vscode-test-explorer
humao.rest-client
Ionide.Ionide-fsharp
James-Yu.latex-workshop
jcanero.hoogle-vscode
jebbs.plantuml
joaompinto.vscode-graphviz
jnoortheen.nix-ide
justusadam.language-haskell
kahole.magit
kaiwood.endwise
leanprover.lean4
lucax88x.codeacejumper
mads-hartmann.bash-ide-vscode
mattn.Lisp
maximedenes.vscoq
meraymond.idris-vscode
ms-azuretools.vscode-docker
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.python
ms-python.vscode-pylance
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.makefile-tools
ms-vscode.test-adapter-converter
mtxr.sqltools
mtxr.sqltools-driver-mysql
mtxr.sqltools-driver-pg
naco-siren.gradle-language
nicoespeon.abracadabra
notskm.clang-tidy
ocamllabs.ocaml-platform
redhat.java
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.LiveServer
Rubymaniac.vscode-direnv
rust-lang.rust-analyzer
ryanolsonx.zenburn
scala-lang.scala
scalameta.metals
serayuzgur.crates
Shopify.ruby-extensions-pack
Shopify.ruby-lsp
sjhuangx.vscode-scheme
skyapps.fish-vscode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
timonwong.shellcheck
tomoki1207.pdf
twxs.cmake
usernamehw.errorlens
vmware.vscode-spring-boot
vscjava.vscode-java-debug
vscjava.vscode-java-test
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vscode-org-mode.org-mode
wayou.vscode-todo-highlight
wix.glean
xabikos.JavaScriptSnippets
xaver.clang-format
yzhang.markdown-all-in-one
zxh404.vscode-proto3
